MaJerle/stm32f429/00-STM32_SVD/STM32F302x.svd
/bitOffset><bitWidth>1</bitWidth></field><field><name>PR15</name><description>Pending bit 15</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field><field><name>PR16</name><description>Pending bit 16</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth></field><field><name>PR17</name><description>Pending bit 17</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth></field><field><name>PR18</name><description>Pending bit 18</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth></field><field><name>PR19</name><description>Pending bit 19</description><bitOffset>19</bitOffset><bitWidth>1</bitWidth></field><field><name>PR20</name><description>Pending bit 20</description><bitOffset>20</bitOffset><bitWidth>1</bitWidth></field><field><name>PR21</name><description>Pending bit 21</description><bitOffset>21</bitOffset><bitWidth>1</bitWidth></field><field><name>PR22</name><description>Pending bit 22</description><bitOffset>22</bitOffset><bitWidth>1</bitWidth></field><field><name>PR29</name><description>Pending bit 29</description><bitOffset>29</bitOffset><bitWidth>1</bitWidth></field><field><name>PR30</name><description>Pending bit 30</description><bitOffset>30</bitOffset><bitWidth>1</bitWidth></field><field><name>PR31</name><description>Pending bit 31</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>IMR2</name><displayName>IMR2</displayName><description>Interrupt mask register</description><addressOffset>0x18</addressOffset><size>0x20</size><access>read-write</access><resetValue>0xFFFFFFFC</resetValue><fields><field><name>MR32</name><description>Interrupt Mask on external/internal line               32</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>MR33</name><description>Interrupt Mask on external/internal line               33</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>MR34</name><description>Interrupt Mask on external/internal line               34</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>MR35</name><description>Interrupt Mask on external/internal line               35</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>EMR2</name><displayName>EMR2</displayName><description>Event mask register</description><addressOffset>0x1C</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>MR32</name><description>Event mask on external/internal line               32</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>MR33</name><description>Event mask on external/internal line               33</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>MR34</name><description>Event mask on external/internal line               34</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>MR35</name><description>Event mask on external/internal line               35</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>RTSR2</name><displayName>RTSR2</displayName><description>Rising Trigger selection           register</description><addressOffset>0x20</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>TR32</name><description>Rising trigger event configuration bit               of line 32</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>TR33</name><description>Rising trigger event configuration bit               of line 33</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>FTSR2</name><displayName>FTSR2</displayName><description>Falling Trigger selection           register</description><addressOffset>0x24</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>TR32</name><description>Falling trigger event configuration bit               of line 32</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>TR33</name><description>Falling trigger event configuration bit               of line 33</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>SWIER2</name><displayName>SWIER2</displayName><description>Software interrupt event           register</description><addressOffset>0x28</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>SWIER32</name><description>Software interrupt on line               32</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>SWIER33</name><description>Software interrupt on line               33</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>PR2</name><displayName>PR2</displayName><description>Pending register</description><addressOffset>0x2C</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>PR32</name><description>Pending bit on line 32</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>PR33</name><description>Pending bit on line 33</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field></fields></register></registers></peripheral><peripheral><name>COMP</name><description>Comparator</description><groupName>COMP</groupName><baseAddress>0x40010020</baseAddress><addressBlock><offset>0x0</offset><size>0x15</size><usage>registers</usage></addressBlock><interrupt><name>SPI1</name><description>SPI1 global interrupt</description><value>35</value></interrupt><registers><register><name>COMP2_CSR</name><displayName>COMP2_CSR</displayName><description>control and status register</description><addressOffset>0x4</addressOffset><size>0x20</size><resetValue>0x00000000</resetValue><fields><field><name>COMP2EN</name><description>Comparator 2 enable</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>COMP2MODE</name><description>Comparator 2 mode</description><bitOffset>2</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>COMP2INSEL</name><description>Comparator 2 inverting input               selection</description><bitOffset>4</bitOffset><bitWidth>3</bitWidth><access>read-write</access></field><field><name>COMP2INPSEL</name><description>Comparator 2 non inverted input               selection</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>COMP2INMSEL</name><description>Comparator 1inverting input               selection</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>COMP2_OUT_SEL</name><description>Comparator 2 output               selection</description><bitOffset>10</bitOffset><bitWidth>4</bitWidth><access>read-write</access></field><field><name>COMP2POL</name><description>Comparator 2 output               polarity</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>COMP2HYST</name><description>Comparator 2 hysteresis</description><bitOffset>16</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>COMP2_BLANKING</name><description>Comparator 2 blanking               source</description><bitOffset>18</bitOffset><bitWidth>3</bitWidth><access>read-write</access></field><field><name>COMP2OUT</name><description>Comparator 2 output</description><bitOffset>30</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>COMP2LOCK</name><description>Comparator 2 lock</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>COMP4_CSR</name><displayName>COMP4_CSR</displayName><description>control and status register</description><addressOffset>0xC</addressOffset><size>0x20</size><resetValue>0x00000000</resetValue><fields><field><name>COMP4EN</name><description>Comparator 4 enable</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>COMP4MODE</name><description>Comparator 4 mode</description><bitOffset>2</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>COMP4INSEL</name><description>Comparator 4 inverting input               selection</description><bitOffset>4</bitOffset><bitWidth>3</bitWidth><access>read-write</access></field><field><name>COMP4INPSEL</name><description>Comparator 4 non inverted input               selection</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>COM4WINMODE</name><description>Comparator 4 window mode</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>COMP4_OUT_SEL</name><description>Comparator 4 output               selection</description><bitOffset>10</bitOffset><bitWidth>4</bitWidth><access>read-write</access></field><field><name>COMP4POL</name><description>Comparator 4 output               polarity</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>COMP4HYST</name><description>Comparator 4 hysteresis</description><bitOffset>16</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>COMP4_BLANKING</name><description>Comparator 4 blanking               source</description><bitOffset>18</bitOffset><bitWidth>3</bitWidth><access>read-write</access></field><field><name>COMP4OUT</name><description>Comparator 4 output</description><bitOffset>30</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>COMP4LOCK</name><description>Comparator 4 lock</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>COMP6_CSR</name><displayName>COMP6_CSR</displayName><description>control and status register</description><addressOffset>0x14</addressOffset><size>0x20</size><resetValue>0x00000000</resetValue><fields><field><name>COMP6EN</name><description>Comparator 6 enable</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>COMP6MODE</name><description>Comparator 6 mode</description><bitOffset>2</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>COMP6INSEL</name><description>Comparator 6 inverting input               selection</description><bitOffset>4</bitOffset><bitWidth>3</bitWidth><access>read-write</access></field><field><name>COMP6INPSEL</name><description>Comparator 6 non inverted input               selection</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>COM6WINMODE</name><description>Comparator 6 window mode</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>COMP6_OUT_SEL</name><description>Comparator 6 output               selection</description><bitOffset>10</bitOffset><bitWidth>4</bitWidth><access>read-write</access></field><field><name>COMP6POL</name><description>Comparator 6 output               polarity</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>COMP6HYST</name><description>Comparator 6 hysteresis</description><bitOffset>16</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>COMP6_BLANKING</name><description>Comparator 6 blanking               source</description><bitOffset>18</bitOffset><bitWidth>3</bitWidth><access>read-write</access></field><field><name>COMP6OUT</name><description>Comparator 6 output</description><bitOffset>30</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>COMP6LOCK</name><description>Comparator 6 lock</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register></registers></peripheral><peripheral><name>PWR</name><description>Power control</description><groupName>PWR</groupName><baseAddress>0x40007000</baseAddress><addressBlock><offset>0x0</offset><size>0x400</size><usage>registers</usage></addressBlock><interrupt><name>SPI2</name><description>SPI2 global interrupt</description><value>36</value></interrupt><registers><register><name>CR</name><displayName>CR</displayName><description>power control register</description><addressOffset>0x0</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>LPDS</name><description>Low-power deep sleep</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>PDDS</name><description>Power down deepsleep</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>CWUF</name><description>Clear wakeup flag</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>CSBF</name><description>Clear standby flag</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>PVDE</name><description>Power voltage detector               enable</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>PLS</name><description>PVD level selection</description><bitOffset>5</bitOffset><bitWidth>3</bitWidth></field><field><name>DBP</name><description>Disable backup domain write               protection</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>CSR</name><displayName>CSR</displayName><description>power control/status register</description><addressOffset>0x4</addressOffset><size>0x20</size><resetValue>0x00000000</resetValue><fields><field><name>WUF</name><description>Wakeup flag</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>SBF</name><description>Standby flag</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>PVDO</name><description>PVD output</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>EWUP1</name><description>Enable WKUP1 pin</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>EWUP2</name><description>Enable WKUP2 pin</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register></registers></peripheral><peripheral><name>CAN</name><description>Controller area network</description><groupName>CAN</groupName><baseAddress>0x40006400</baseAddress><addressBlock><offset>0x0</offset><size>0x400</size><usage>registers</usage></addressBlock><interrupt><name>SPI3</name><description>SPI3 global interrupt</description><value>51</value></interrupt><registers><register><name>MCR</name><displayName>MCR</displayName><description>master control register</description><addressOffset>0x0</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00010002</resetValue><fields><field><name>DBF</name><description>DBF</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth></field><field><name>RESET</name><description>RESET</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field><field><name>TTCM</name><description>TTCM</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>ABOM</name><description>ABOM</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>AWUM</name><description>AWUM</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>NART</name><description>NART</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>RFLM</name><description>RFLM</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>TXFP</name><description>TXFP</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>SLEEP</name><description>SLEEP</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>INRQ</name><description>INRQ</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>MSR</name><displayName>MSR</displayName><description>master status register</description><addressOffset>0x4</addressOffset><size>0x20</size><resetValue>0x00000C02</resetValue><fields><field><name>RX</name><description>RX</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>SAMP</name><description>SAMP</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>RXM</name><description>RXM</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>TXM</name><description>TXM</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>SLAKI</name><description>SLAKI</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>WKUI</name><description>WKUI</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ERRI</name><description>ERRI</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>SLAK</name><description>SLAK</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>INAK</name><description>INAK</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field></fields></register><register><name>TSR</name><displayName>TSR</displayName><description>transmit status register</description><addressOffset>0x8</addressOffset><size>0x20</size><resetValue>0x1C000000</resetValue><fields><field><name>LOW2</name><description>Lowest priority flag for mailbox               2</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>LOW1</name><description>Lowest priority flag for mailbox               1</description><bitOffset>30</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>LOW0</name><description>Lowest priority flag for mailbox               0</description><bitOffset>29</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>TME2</name><description>Lowest priority flag for mailbox               2</description><bitOffset>28</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>TME1</name><description>Lowest priority flag for mailbox               1</description><bitOffset>27</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>TME0</name><description>Lowest priority flag for mailbox               0</description><bitOffset>26</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>CODE</name><description>CODE</description><bitOffset>24</bitOffset><bitWidth>2</bitWidth><access>read-only</access></field><field><name>ABRQ2</name><description>ABRQ2</description><bitOffset>23</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TERR2</name><description>TERR2</description><bitOffset>19</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ALST2</name><description>ALST2</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TXOK2</name><description>TXOK2</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>RQCP2</name><description>RQCP2</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ABRQ1</name><description>ABRQ1</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TERR1</name><description>TERR1</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ALST1</name><description>ALST1</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TXOK1</name><description>TXOK1</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>RQCP1</name><description>RQCP1</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ABRQ0</name><description>ABRQ0</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TERR0</name><description>TERR0</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ALST0</name><description>ALST0</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TXOK0</name><description>TXOK0</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>RQCP0</name><description>RQCP0</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>RF0R</name><displayName>RF0R</displayName><description>receive FIFO 0 register</description><addressOffset>0xC</addressOffset><size>0x20</size><resetValue>0x00000000</resetValue><fields><field><name>RFOM0</name><description>RFOM0</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>FOVR0</name><description>FOVR0</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>FULL0</name><description>FULL0</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>FMP0</name><description>FMP0</description><bitOffset>0</bitOffset><bitWidth>2</bitWidth><access>read-only</access></field></fields></register><register><name>RF1R</name><displayName>RF1R</displayName><description>receive FIFO 1 register</description><addressOffset>0x10</addressOffset><size>0x20</size><resetValue>0x00000000</resetValue><fields><field><name>RFOM1</name><description>RFOM1</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>FOVR1</name><description>FOVR1</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>FULL1</name><description>FULL1</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>FMP1</name><description>FMP1</description><bitOffset>0</bitOffset><bitWidth>2</bitWidth><access>read-only</access></field></fields></register><register><name>IER</name><displayName>IER</displayName><description>interrupt enable register</description><addressOffset>0x14</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>SLKIE</name><description>SLKIE</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth></field><field><name>WKUIE</name><description>WKUIE</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth></field><field><name>ERRIE</name><description>ERRIE</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field><field><name>LECIE</name><description>LECIE</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field><field><name>BOFIE</name><description>BOFIE</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field><field><name>EPVIE</name><description>EPVIE</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>EWGIE</name><description>EWGIE</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>FOVIE1</name><description>FOVIE1</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>FFIE1</name