MaJerle/stm32f429/00-STM32_SVD/STM32F302x.svd
><description>FFIE1</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>FMPIE1</name><description>FMPIE1</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>FOVIE0</name><description>FOVIE0</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>FFIE0</name><description>FFIE0</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>FMPIE0</name><description>FMPIE0</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>TMEIE</name><description>TMEIE</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>ESR</name><displayName>ESR</displayName><description>error status register</description><addressOffset>0x18</addressOffset><size>0x20</size><resetValue>0x00000000</resetValue><fields><field><name>REC</name><description>REC</description><bitOffset>24</bitOffset><bitWidth>8</bitWidth><access>read-only</access></field><field><name>TEC</name><description>TEC</description><bitOffset>16</bitOffset><bitWidth>8</bitWidth><access>read-only</access></field><field><name>LEC</name><description>LEC</description><bitOffset>4</bitOffset><bitWidth>3</bitWidth><access>read-write</access></field><field><name>BOFF</name><description>BOFF</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>EPVF</name><description>EPVF</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>EWGF</name><description>EWGF</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field></fields></register><register><name>BTR</name><displayName>BTR</displayName><description>bit timing register</description><addressOffset>0x1C</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x01230000</resetValue><fields><field><name>SILM</name><description>SILM</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth></field><field><name>LBKM</name><description>LBKM</description><bitOffset>30</bitOffset><bitWidth>1</bitWidth></field><field><name>SJW</name><description>SJW</description><bitOffset>24</bitOffset><bitWidth>2</bitWidth></field><field><name>TS2</name><description>TS2</description><bitOffset>20</bitOffset><bitWidth>3</bitWidth></field><field><name>TS1</name><description>TS1</description><bitOffset>16</bitOffset><bitWidth>4</bitWidth></field><field><name>BRP</name><description>BRP</description><bitOffset>0</bitOffset><bitWidth>10</bitWidth></field></fields></register><register><name>TI0R</name><displayName>TI0R</displayName><description>TX mailbox identifier register</description><addressOffset>0x180</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>STID</name><description>STID</description><bitOffset>21</bitOffset><bitWidth>11</bitWidth></field><field><name>EXID</name><description>EXID</description><bitOffset>3</bitOffset><bitWidth>18</bitWidth></field><field><name>IDE</name><description>IDE</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>RTR</name><description>RTR</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>TXRQ</name><description>TXRQ</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>TDT0R</name><displayName>TDT0R</displayName><description>mailbox data length control and time stamp           register</description><addressOffset>0x184</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>TIME</name><description>TIME</description><bitOffset>16</bitOffset><bitWidth>16</bitWidth></field><field><name>TGT</name><description>TGT</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>DLC</name><description>DLC</description><bitOffset>0</bitOffset><bitWidth>4</bitWidth></field></fields></register><register><name>TDL0R</name><displayName>TDL0R</displayName><description>mailbox data low register</description><addressOffset>0x188</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>DATA3</name><description>DATA3</description><bitOffset>24</bitOffset><bitWidth>8</bitWidth></field><field><name>DATA2</name><description>DATA2</description><bitOffset>16</bitOffset><bitWidth>8</bitWidth></field><field><name>DATA1</name><description>DATA1</description><bitOffset>8</bitOffset><bitWidth>8</bitWidth></field><field><name>DATA0</name><description>DATA0</description><bitOffset>0</bitOffset><bitWidth>8</bitWidth></field></fields></register><register><name>TDH0R</name><displayName>TDH0R</displayName><description>mailbox data high register</description><addressOffset>0x18C</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>DATA7</name><description>DATA7</description><bitOffset>24</bitOffset><bitWidth>8</bitWidth></field><field><name>DATA6</name><description>DATA6</description><bitOffset>16</bitOffset><bitWidth>8</bitWidth></field><field><name>DATA5</name><description>DATA5</description><bitOffset>8</bitOffset><bitWidth>8</bitWidth></field><field><name>DATA4</name><description>DATA4</description><bitOffset>0</bitOffset><bitWidth>8</bitWidth></field></fields></register><register><name>TI1R</name><displayName>TI1R</displayName><description>TX mailbox identifier register</description><addressOffset>0x190</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>STID</name><description>STID</description><bitOffset>21</bitOffset><bitWidth>11</bitWidth></field><field><name>EXID</name><description>EXID</description><bitOffset>3</bitOffset><bitWidth>18</bitWidth></field><field><name>IDE</name><description>IDE</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>RTR</name><description>RTR</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>TXRQ</name><description>TXRQ</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>TDT1R</name><displayName>TDT1R</displayName><description>mailbox data length control and time stamp           register</description><addressOffset>0x194</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>TIME</name><description>TIME</description><bitOffset>16</bitOffset><bitWidth>16</bitWidth></field><field><name>TGT</name><description>TGT</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>DLC</name><description>DLC</description><bitOffset>0</bitOffset><bitWidth>4</bitWidth></field></fields></register><register><name>TDL1R</name><displayName>TDL1R</displayName><description>mailbox data low register</description><addressOffset>0x198</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>DATA3</name><description>DATA3</description><bitOffset>24</bitOffset><bitWidth>8</bitWidth></field><field><name>DATA2</name><description>DATA2</description><bitOffset>16</bitOffset><bitWidth>8</bitWidth></field><field><name>DATA1</name><description>DATA1</description><bitOffset>8</bitOffset><bitWidth>8</bitWidth></field><field><name>DATA0</name><description>DATA0</description><bitOffset>0</bitOffset><bitWidth>8</bitWidth></field></fields></register><register><name>TDH1R</name><displayName>TDH1R</displayName><description>mailbox data high register</description><addressOffset>0x19C</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>DATA7</name><description>DATA7</description><bitOffset>24</bitOffset><bitWidth>8</bitWidth></field><field><name>DATA6</name><description>DATA6</description><bitOffset>16</bitOffset><bitWidth>8</bitWidth></field><field><name>DATA5</name><description>DATA5</description><bitOffset>8</bitOffset><bitWidth>8</bitWidth></field><field><name>DATA4</name><description>DATA4</description><bitOffset>0</bitOffset><bitWidth>8</bitWidth></field></fields></register><register><name>TI2R</name><displayName>TI2R</displayName><description>TX mailbox identifier register</description><addressOffset>0x1A0</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>STID</name><description>STID</description><bitOffset>21</bitOffset><bitWidth>11</bitWidth></field><field><name>EXID</name><description>EXID</description><bitOffset>3</bitOffset><bitWidth>18</bitWidth></field><field><name>IDE</name><description>IDE</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>RTR</name><description>RTR</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>TXRQ</name><description>TXRQ</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>TDT2R</name><displayName>TDT2R</displayName><description>mailbox data length control and time stamp           register</description><addressOffset>0x1A4</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>TIME</name><description>TIME</description><bitOffset>16</bitOffset><bitWidth>16</bitWidth></field><field><name>TGT</name><description>TGT</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>DLC</name><description>DLC</description><bitOffset>0</bitOffset><bitWidth>4</bitWidth></field></fields></register><register><name>TDL2R</name><displayName>TDL2R</displayName><description>mailbox data low register</description><addressOffset>0x1A8</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>DATA3</name><description>DATA3</description><bitOffset>24</bitOffset><bitWidth>8</bitWidth></field><field><name>DATA2</name><description>DATA2</description><bitOffset>16</bitOffset><bitWidth>8</bitWidth></field><field><name>DATA1</name><description>DATA1</description><bitOffset>8</bitOffset><bitWidth>8</bitWidth></field><field><name>DATA0</name><description>DATA0</description><bitOffset>0</bitOffset><bitWidth>8</bitWidth></field></fields></register><register><name>TDH2R</name><displayName>TDH2R</displayName><description>mailbox data high register</description><addressOffset>0x1AC</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>DATA7</name><description>DATA7</description><bitOffset>24</bitOffset><bitWidth>8</bitWidth></field><field><name>DATA6</name><description>DATA6</description><bitOffset>16</bitOffset><bitWidth>8</bitWidth></field><field><name>DATA5</name><description>DATA5</description><bitOffset>8</bitOffset><bitWidth>8</bitWidth></field><field><name>DATA4</name><description>DATA4</description><bitOffset>0</bitOffset><bitWidth>8</bitWidth></field></fields></register><register><name>RI0R</name><displayName>RI0R</displayName><description>receive FIFO mailbox identifier           register</description><addressOffset>0x1B0</addressOffset><size>0x20</size><access>read-only</access><resetValue>0x00000000</resetValue><fields><field><name>STID</name><description>STID</description><bitOffset>21</bitOffset><bitWidth>11</bitWidth></field><field><name>EXID</name><description>EXID</description><bitOffset>3</bitOffset><bitWidth>18</bitWidth></field><field><name>IDE</name><description>IDE</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>RTR</name><description>RTR</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>RDT0R</name><displayName>RDT0R</displayName><description>receive FIFO mailbox data length control and           time stamp register</description><addressOffset>0x1B4</addressOffset><size>0x20</size><access>read-only</access><resetValue>0x00000000</resetValue><fields><field><name>TIME</name><description>TIME</description><bitOffset>16</bitOffset><bitWidth>16</bitWidth></field><field><name>FMI</name><description>FMI</description><bitOffset>8</bitOffset><bitWidth>8</bitWidth></field><field><name>DLC</name><description>DLC</description><bitOffset>0</bitOffset><bitWidth>4</bitWidth></field></fields></register><register><name>RDL0R</name><displayName>RDL0R</displayName><description>receive FIFO mailbox data low           register</description><addressOffset>0x1B8</addressOffset><size>0x20</size><access>read-only</access><resetValue>0x00000000</resetValue><fields><field><name>DATA3</name><description>DATA3</description><bitOffset>24</bitOffset><bitWidth>8</bitWidth></field><field><name>DATA2</name><description>DATA2</description><bitOffset>16</bitOffset><bitWidth>8</bitWidth></field><field><name>DATA1</name><description>DATA1</description><bitOffset>8</bitOffset><bitWidth>8</bitWidth></field><field><name>DATA0</name><description>DATA0</description><bitOffset>0</bitOffset><bitWidth>8</bitWidth></field></fields></register><register><name>RDH0R</name><displayName>RDH0R</displayName><description>receive FIFO mailbox data high           register</description><addressOffset>0x1BC</addressOffset><size>0x20</size><access>read-only</access><resetValue>0x00000000</resetValue><fields><field><name>DATA7</name><description>DATA7</description><bitOffset>24</bitOffset><bitWidth>8</bitWidth></field><field><name>DATA6</name><description>DATA6</description><bitOffset>16</bitOffset><bitWidth>8</bitWidth></field><field><name>DATA5</name><description>DATA5</description><bitOffset>8</bitOffset><bitWidth>8</bitWidth></field><field><name>DATA4</name><description>DATA4</description><bitOffset>0</bitOffset><bitWidth>8</bitWidth></field></fields></register><register><name>RI1R</name><displayName>RI1R</displayName><description>receive FIFO mailbox identifier           register</description><addressOffset>0x1C0</addressOffset><size>0x20</size><access>read-only</access><resetValue>0x00000000</resetValue><fields><field><name>STID</name><description>STID</description><bitOffset>21</bitOffset><bitWidth>11</bitWidth></field><field><name>EXID</name><description>EXID</description><bitOffset>3</bitOffset><bitWidth>18</bitWidth></field><field><name>IDE</name><description>IDE</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>RTR</name><description>RTR</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>RDT1R</name><displayName>RDT1R</displayName><description>receive FIFO mailbox data length control and           time stamp register</description><addressOffset>0x1C4</addressOffset><size>0x20</size><access>read-only</access><resetValue>0x00000000</resetValue><fields><field><name>TIME</name><description>TIME</description><bitOffset>16</bitOffset><bitWidth>16</bitWidth></field><field><name>FMI</name><description>FMI</description><bitOffset>8</bitOffset><bitWidth>8</bitWidth></field><field><name>DLC</name><description>DLC</description><bitOffset>0</bitOffset><bitWidth>4</bitWidth></field></fields></register><register><name>RDL1R</name><displayName>RDL1R</displayName><description>receive FIFO mailbox data low           register</description><addressOffset>0x1C8</addressOffset><size>0x20</size><access>read-only</access><resetValue>0x00000000</resetValue><fields><field><name>DATA3</name><description>DATA3</description><bitOffset>24</bitOffset><bitWidth>8</bitWidth></field><field><name>DATA2</name><description>DATA2</description><bitOffset>16</bitOffset><bitWidth>8</bitWidth></field><field><name>DATA1</name><description>DATA1</description><bitOffset>8</bitOffset><bitWidth>8</bitWidth></field><field><name>DATA0</name><description>DATA0</description><bitOffset>0</bitOffset><bitWidth>8</bitWidth></field></fields></register><register><name>RDH1R</name><displayName>RDH1R</displayName><description>receive FIFO mailbox data high           register</description><addressOffset>0x1CC</addressOffset><size>0x20</size><access>read-only</access><resetValue>0x00000000</resetValue><fields><field><name>DATA7</name><description>DATA7</description><bitOffset>24</bitOffset><bitWidth>8</bitWidth></field><field><name>DATA6</name><description>DATA6</description><bitOffset>16</bitOffset><bitWidth>8</bitWidth></field><field><name>DATA5</name><description>DATA5</description><bitOffset>8</bitOffset><bitWidth>8</bitWidth></field><field><name>DATA4</name><description>DATA4</description><bitOffset>0</bitOffset><bitWidth>8</bitWidth></field></fields></register><register><name>FMR</name><displayName>FMR</displayName><description>filter master register</description><addressOffset>0x200</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x2A1C0E01</resetValue><fields><field><name>CAN2SB</name><description>CAN2 start bank</description><bitOffset>8</bitOffset><bitWidth>6</bitWidth></field><field><name>FINIT</name><description>Filter init mode</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>FM1R</name><displayName>FM1R</displayName><description>filter mode register</description><addressOffset>0x204</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>FBM0</name><description>Filter mode</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>FBM1</name><description>Filter mode</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>FBM2</name><description>Filter mode</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>FBM3</name><description>Filter mode</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>FBM4</name><description>Filter mode</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>FBM5</name><description>Filter mode</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>FBM6</name><description>Filter mode</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>FBM7</name><description>Filter mode</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>FBM8</name><description>Filter mode</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>FBM9</name><description>Filter mode</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>FBM10</name><description>Filter mode</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field><field><name>FBM11</name><description>Filter mode</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field><field><name>FBM12</name><description>Filter mode</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field><field><name>FBM13</name><description>Filter mode</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth></field><field><name>FBM14</name><description>Filter mode</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field><field><name>FBM15</name><description>Filter mode</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field><field><name>FBM16</name><description>Filter mode</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth></field><field><name>FBM17</name><description>Filter mode</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth></field><field><name>FBM18</name><description>Filter mode</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth></field><field><name>FBM19</name><description>Filter mode</description><bitOffset>19</bitOffset><bitWidth>1</bitWidth></field><field><name>FBM20</name><description>Filter mode</description><bitOffset>20</bitOffset><bitWidth>1</bitWidth></field><field><name>FBM21</name><description>Filter mode</description><bitOffset>21</bitOffset><bitWidth>1</bitWidth></field><field><name>FBM22</name><description>Filter mode</description><bitOffset>22</bitOffset><bitWidth>1</bitWidth></field><field><name>FBM23</name><description>Filter mode</description><bitOffset>23</bitOffset><bitWidth>1</bitWidth></field><field><name>FBM24</name><description>Filter mode</description><bitOffset>24</bitOffset><bitWidth>1</bitWidth></field><field><name>FBM25</name><description>Filter mode</description><bitOffset>25</bitOffset><bitWidth>1</bitWidth></field><field><name>FBM26</name><description>Filter mode</description><bitOffset>26</bitOffset><bitWidth>1</bitWidth></field><field><name>FBM27</name><description>Filter mode</description><bitOffset>27</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>FS1R</name><displayName>FS1R</displayName><description>filter scale register</description><addressOffset>0x20C</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>FSC0</name><description>Filter scale configuration</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>FSC1</name><description>Filter scale configuration</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>FSC2</name><description>Filter scale configuration</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>FSC3</name><description>Filter scale configuration</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>FSC4</name><description>Filter scale configuration</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>FSC5</name><description>Filter scale configuration</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>FSC6</name><description>Filter scale configuration</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>FSC7</name><description>Filter scale configuration</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>FSC8</name><description>Filter scale configuration</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>FSC9</name><description>Filter scale configuration</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>FSC10</name><description>Filter scale configuration</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field><field><name>FSC11</name><description>Filter scale configuration</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field><field><name>FSC12</name><description>Filter scale configuration</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field><field><name>FSC13</name><description>Filter scale configuration</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth></field><field><name>FSC14</name><description>Filter scale configuration</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field><field><name>FSC15</name><description>Filter scale configuration</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field><field><name>FSC16</name><description>Filter scale configuration</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth></field><field><name>FSC17</name><description>Filter scale configuration</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth></field><field><name>FSC18</name><description>Filter scale configuration</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth></field><field><name>FSC19</name><description>Filter scale configuration</description><bitOffset>19</bitOffset><bitWidth>1</bitWidth></field><field><name>FSC20</name><description>Filter scale configuration</description><bitOffset>20</bitOffset><bitWidth>1</bitWidth></field><field><name>FSC21</name><description>Filter scale configuration</description><bitOffset>21</bitOffset><bitWidth>1</bitWidth></field><field><name>FSC22</name><description>Filter scale configuration</description><bitOffset>22</bitOffset><bitWidth>1</bitWidth></field><field><name>FSC23</name><description>Filter scale configuration</description><bi