MaJerle/stm32f429/00-STM32_SVD/STM32F302x.svd
><bitOffset>0</bitOffset><bitWidth>4</bitWidth><access>read-write</access></field><field><name>STAT_TX</name><description>Status bits, for transmission               transfers</description><bitOffset>4</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>DTOG_TX</name><description>Data Toggle, for transmission               transfers</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CTR_TX</name><description>Correct Transfer for               transmission</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>EP_KIND</name><description>Endpoint kind</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>EP_TYPE</name><description>Endpoint type</description><bitOffset>9</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>SETUP</name><description>Setup transaction               completed</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>STAT_RX</name><description>Status bits, for reception               transfers</description><bitOffset>12</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>DTOG_RX</name><description>Data Toggle, for reception               transfers</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CTR_RX</name><description>Correct transfer for               reception</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>USB_EP5R</name><displayName>USB_EP5R</displayName><description>endpoint 5 register</description><addressOffset>0x14</addressOffset><size>0x20</size><resetValue>0x00000000</resetValue><fields><field><name>EA</name><description>Endpoint address</description><bitOffset>0</bitOffset><bitWidth>4</bitWidth><access>read-write</access></field><field><name>STAT_TX</name><description>Status bits, for transmission               transfers</description><bitOffset>4</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>DTOG_TX</name><description>Data Toggle, for transmission               transfers</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CTR_TX</name><description>Correct Transfer for               transmission</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>EP_KIND</name><description>Endpoint kind</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>EP_TYPE</name><description>Endpoint type</description><bitOffset>9</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>SETUP</name><description>Setup transaction               completed</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>STAT_RX</name><description>Status bits, for reception               transfers</description><bitOffset>12</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>DTOG_RX</name><description>Data Toggle, for reception               transfers</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CTR_RX</name><description>Correct transfer for               reception</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>USB_EP6R</name><displayName>USB_EP6R</displayName><description>endpoint 6 register</description><addressOffset>0x18</addressOffset><size>0x20</size><resetValue>0x00000000</resetValue><fields><field><name>EA</name><description>Endpoint address</description><bitOffset>0</bitOffset><bitWidth>4</bitWidth><access>read-write</access></field><field><name>STAT_TX</name><description>Status bits, for transmission               transfers</description><bitOffset>4</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>DTOG_TX</name><description>Data Toggle, for transmission               transfers</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CTR_TX</name><description>Correct Transfer for               transmission</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>EP_KIND</name><description>Endpoint kind</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>EP_TYPE</name><description>Endpoint type</description><bitOffset>9</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>SETUP</name><description>Setup transaction               completed</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>STAT_RX</name><description>Status bits, for reception               transfers</description><bitOffset>12</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>DTOG_RX</name><description>Data Toggle, for reception               transfers</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CTR_RX</name><description>Correct transfer for               reception</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>USB_EP7R</name><displayName>USB_EP7R</displayName><description>endpoint 7 register</description><addressOffset>0x1C</addressOffset><size>0x20</size><resetValue>0x00000000</resetValue><fields><field><name>EA</name><description>Endpoint address</description><bitOffset>0</bitOffset><bitWidth>4</bitWidth><access>read-write</access></field><field><name>STAT_TX</name><description>Status bits, for transmission               transfers</description><bitOffset>4</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>DTOG_TX</name><description>Data Toggle, for transmission               transfers</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CTR_TX</name><description>Correct Transfer for               transmission</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>EP_KIND</name><description>Endpoint kind</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>EP_TYPE</name><description>Endpoint type</description><bitOffset>9</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>SETUP</name><description>Setup transaction               completed</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>STAT_RX</name><description>Status bits, for reception               transfers</description><bitOffset>12</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>DTOG_RX</name><description>Data Toggle, for reception               transfers</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CTR_RX</name><description>Correct transfer for               reception</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>USB_CNTR</name><displayName>USB_CNTR</displayName><description>control register</description><addressOffset>0x40</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000003</resetValue><fields><field><name>FRES</name><description>Force USB Reset</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>PDWN</name><description>Power down</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>LPMODE</name><description>Low-power mode</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>FSUSP</name><description>Force suspend</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>RESUME</name><description>Resume request</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>ESOFM</name><description>Expected start of frame interrupt               mask</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>SOFM</name><description>Start of frame interrupt               mask</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>RESETM</name><description>USB reset interrupt mask</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field><field><name>SUSPM</name><description>Suspend mode interrupt               mask</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field><field><name>WKUPM</name><description>Wakeup interrupt mask</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field><field><name>ERRM</name><description>Error interrupt mask</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth></field><field><name>PMAOVRM</name><description>Packet memory area over / underrun               interrupt mask</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field><field><name>CTRM</name><description>Correct transfer interrupt               mask</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>ISTR</name><displayName>ISTR</displayName><description>interrupt status register</description><addressOffset>0x44</addressOffset><size>0x20</size><resetValue>0x00000000</resetValue><fields><field><name>EP_ID</name><description>Endpoint Identifier</description><bitOffset>0</bitOffset><bitWidth>4</bitWidth><access>read-only</access></field><field><name>DIR</name><description>Direction of transaction</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>ESOF</name><description>Expected start frame</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>SOF</name><description>start of frame</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>RESET</name><description>reset request</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>SUSP</name><description>Suspend mode request</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>WKUP</name><description>Wakeup</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ERR</name><description>Error</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PMAOVR</name><description>Packet memory area over /               underrun</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CTR</name><description>Correct transfer</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field></fields></register><register><name>FNR</name><displayName>FNR</displayName><description>frame number register</description><addressOffset>0x48</addressOffset><size>0x20</size><access>read-only</access><resetValue>0x0000</resetValue><fields><field><name>FN</name><description>Frame number</description><bitOffset>0</bitOffset><bitWidth>11</bitWidth></field><field><name>LSOF</name><description>Lost SOF</description><bitOffset>11</bitOffset><bitWidth>2</bitWidth></field><field><name>LCK</name><description>Locked</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth></field><field><name>RXDM</name><description>Receive data - line status</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field><field><name>RXDP</name><description>Receive data + line status</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>DADDR</name><displayName>DADDR</displayName><description>device address</description><addressOffset>0x4C</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x0000</resetValue><fields><field><name>ADD</name><description>Device address</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>ADD1</name><description>Device address</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>ADD2</name><description>Device address</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>ADD3</name><description>Device address</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>ADD4</name><description>Device address</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>ADD5</name><description>Device address</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>ADD6</name><description>Device address</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>EF</name><description>Enable function</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>BTABLE</name><displayName>BTABLE</displayName><description>Buffer table address</description><addressOffset>0x50</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x0000</resetValue><fields><field><name>BTABLE</name><description>Buffer table</description><bitOffset>3</bitOffset><bitWidth>13</bitWidth></field></fields></register></registers></peripheral><peripheral><name>I2C1</name><description>Inter-integrated circuit</description><groupName>I2C</groupName><baseAddress>0x40005400</baseAddress><addressBlock><offset>0x0</offset><size>0x400</size><usage>registers</usage></addressBlock><registers><register><name>CR1</name><displayName>CR1</displayName><description>Control register 1</description><addressOffset>0x0</addressOffset><size>0x20</size><resetValue>0x00000000</resetValue><fields><field><name>PE</name><description>Peripheral enable</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TXIE</name><description>TX Interrupt enable</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>RXIE</name><description>RX Interrupt enable</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ADDRIE</name><description>Address match interrupt enable (slave               only)</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>NACKIE</name><description>Not acknowledge received interrupt               enable</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>STOPIE</name><description>STOP detection Interrupt               enable</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TCIE</name><description>Transfer Complete interrupt               enable</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ERRIE</name><description>Error interrupts enable</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>DNF</name><description>Digital noise filter</description><bitOffset>8</bitOffset><bitWidth>4</bitWidth><access>read-write</access></field><field><name>ANFOFF</name><description>Analog noise filter OFF</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>SWRST</name><description>Software reset</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>TXDMAEN</name><description>DMA transmission requests               enable</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>RXDMAEN</name><description>DMA reception requests               enable</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>SBC</name><description>Slave byte control</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>NOSTRETCH</name><description>Clock stretching disable</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>WUPEN</name><description>Wakeup from STOP enable</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>GCEN</name><description>General call enable</description><bitOffset>19</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>SMBHEN</name><description>SMBus Host address enable</description><bitOffset>20</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>SMBDEN</name><description>SMBus Device Default address               enable</description><bitOffset>21</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ALERTEN</name><description>SMBUS alert enable</description><bitOffset>22</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PECEN</name><description>PEC enable</description><bitOffset>23</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>CR2</name><displayName>CR2</displayName><description>Control register 2</description><addressOffset>0x4</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>PECBYTE</name><description>Packet error checking byte</description><bitOffset>26</bitOffset><bitWidth>1</bitWidth></field><field><name>AUTOEND</name><description>Automatic end mode (master               mode)</description><bitOffset>25</bitOffset><bitWidth>1</bitWidth></field><field><name>RELOAD</name><description>NBYTES reload mode</description><bitOffset>24</bitOffset><bitWidth>1</bitWidth></field><field><name>NBYTES</name><description>Number of bytes</description><bitOffset>16</bitOffset><bitWidth>8</bitWidth></field><field><name>NACK</name><description>NACK generation (slave               mode)</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field><field><name>STOP</name><description>Stop generation (master               mode)</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field><field><name>START</name><description>Start generation</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth></field><field><name>HEAD10R</name><description>10-bit address header only read               direction (master receiver mode)</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field><field><name>ADD10</name><description>10-bit addressing mode (master               mode)</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field><field><name>RD_WRN</name><description>Transfer direction (master               mode)</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field><field><name>SADD8</name><description>Slave address bit 9:8 (master               mode)</description><bitOffset>8</bitOffset><bitWidth>2</bitWidth></field><field><name>SADD1</name><description>Slave address bit 7:1 (master               mode)</description><bitOffset>1</bitOffset><bitWidth>7</bitWidth></field><field><name>SADD0</name><description>Slave address bit 0 (master               mode)</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>OAR1</name><displayName>OAR1</displayName><description>Own address register 1</description><addressOffset>0x8</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>OA1_0</name><description>Interface address</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>OA1_1</name><description>Interface address</description><bitOffset>1</bitOffset><bitWidth>7</bitWidth></field><field><name>OA1_8</name><description>Interface address</description><bitOffset>8</bitOffset><bitWidth>2</bitWidth></field><field><name>OA1MODE</name><description>Own Address 1 10-bit mode</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field><field><name>OA1EN</name><description>Own Address 1 enable</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>OAR2</name><displayName>OAR2</displayName><description>Own address register 2</description><addressOffset>0xC</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>OA2</name><description>Interface address</description><bitOffset>1</bitOffset><bitWidth>7</bitWidth></field><field><name>OA2MSK</name><description>Own Address 2 masks</description><bitOffset>8</bitOffset><bitWidth>3</bitWidth></field><field><name>OA2EN</name><description>Own Address 2 enable</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>TIMINGR</name><displayName>TIMINGR</displayName><description>Timing register</description><addressOffset>0x10</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>SCLL</name><description>SCL low period (master               mode)</description><bitOffset>0</bitOffset><bitWidth>8</bitWidth></field><field><name>SCLH</name><description>SCL high period (master               mode)</description><bitOffset>8</bitOffset><bitWidth>8</bitWidth></field><field><name>SDADEL</name><description>Data hold time</description><bitOffset>16</bitOffset><bitWidth>4</bitWidth></field><field><name>SCLDEL</name><description>Data setup time</description><bitOffset>20</bitOffset><bitWidth>4</bitWidth></field><field><name>PRESC</name><description>Timing prescaler</description><bitOffset>28</bitOffset><bitWidth>4</bitWidth></field></fields></register><register><name>TIMEOUTR</name><displayName>TIMEOUTR</displayName><description>Status register 1</description><addressOffset>0x14</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>TIMEOUTA</name><description>Bus timeout A</description><bitOffset>0</bitOffset><bitWidth>12</bitWidth></field><field><name>TIDLE</name><description>Idle clock timeout               detection</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field><field><name>TIMOUTEN</name><description>Clock timeout enable</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field><field><name>TIMEOUTB</name><description>Bus timeout B</description><bitOffset>16</bitOffset><bitWidth>12</bitWidth></field><field><name>TEXTEN</name><description>Extended clock timeout               enable</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>ISR</name><displayName>ISR</displayName><description>Interrupt and Status register</description><addressOffset>0x18</addressOffset><size>0x20</size><resetValue>0x00000001</resetValue><fields><field><name>ADDCODE</name><description>Address match code (Slave               mode)</description><bitOffset>17</bitOffset><bitWidth>7</bitWidth><access>read-only</access></field><field><name>DIR</name><description>Transfer direction (Slave               mode)</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>BUSY</name><description>Bus busy</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>ALERT</name><description>SMBus alert</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>TIMEOUT</name><description>Timeout or t_low detect