MaJerle/stm32f429/00-STM32_SVD/STM32F302x.svd
>0</bitOffset><bitWidth>32</bitWidth></field></fields></register><register><name>BKP7R</name><displayName>BKP7R</displayName><description>backup register</description><addressOffset>0x6C</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>BKP</name><description>BKP</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register><register><name>BKP8R</name><displayName>BKP8R</displayName><description>backup register</description><addressOffset>0x70</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>BKP</name><description>BKP</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register><register><name>BKP9R</name><displayName>BKP9R</displayName><description>backup register</description><addressOffset>0x74</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>BKP</name><description>BKP</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register><register><name>BKP10R</name><displayName>BKP10R</displayName><description>backup register</description><addressOffset>0x78</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>BKP</name><description>BKP</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register><register><name>BKP11R</name><displayName>BKP11R</displayName><description>backup register</description><addressOffset>0x7C</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>BKP</name><description>BKP</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register><register><name>BKP12R</name><displayName>BKP12R</displayName><description>backup register</description><addressOffset>0x80</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>BKP</name><description>BKP</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register><register><name>BKP13R</name><displayName>BKP13R</displayName><description>backup register</description><addressOffset>0x84</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>BKP</name><description>BKP</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register><register><name>BKP14R</name><displayName>BKP14R</displayName><description>backup register</description><addressOffset>0x88</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>BKP</name><description>BKP</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register><register><name>BKP15R</name><displayName>BKP15R</displayName><description>backup register</description><addressOffset>0x8C</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>BKP</name><description>BKP</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register><register><name>BKP16R</name><displayName>BKP16R</displayName><description>backup register</description><addressOffset>0x90</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>BKP</name><description>BKP</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register><register><name>BKP17R</name><displayName>BKP17R</displayName><description>backup register</description><addressOffset>0x94</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>BKP</name><description>BKP</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register><register><name>BKP18R</name><displayName>BKP18R</displayName><description>backup register</description><addressOffset>0x98</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>BKP</name><description>BKP</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register><register><name>BKP19R</name><displayName>BKP19R</displayName><description>backup register</description><addressOffset>0x9C</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>BKP</name><description>BKP</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register><register><name>BKP20R</name><displayName>BKP20R</displayName><description>backup register</description><addressOffset>0xA0</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>BKP</name><description>BKP</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register><register><name>BKP21R</name><displayName>BKP21R</displayName><description>backup register</description><addressOffset>0xA4</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>BKP</name><description>BKP</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register><register><name>BKP22R</name><displayName>BKP22R</displayName><description>backup register</description><addressOffset>0xA8</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>BKP</name><description>BKP</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register><register><name>BKP23R</name><displayName>BKP23R</displayName><description>backup register</description><addressOffset>0xAC</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>BKP</name><description>BKP</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register><register><name>BKP24R</name><displayName>BKP24R</displayName><description>backup register</description><addressOffset>0xB0</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>BKP</name><description>BKP</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register><register><name>BKP25R</name><displayName>BKP25R</displayName><description>backup register</description><addressOffset>0xB4</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>BKP</name><description>BKP</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register><register><name>BKP26R</name><displayName>BKP26R</displayName><description>backup register</description><addressOffset>0xB8</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>BKP</name><description>BKP</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register><register><name>BKP27R</name><displayName>BKP27R</displayName><description>backup register</description><addressOffset>0xBC</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>BKP</name><description>BKP</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register><register><name>BKP28R</name><displayName>BKP28R</displayName><description>backup register</description><addressOffset>0xC0</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>BKP</name><description>BKP</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register><register><name>BKP29R</name><displayName>BKP29R</displayName><description>backup register</description><addressOffset>0xC4</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>BKP</name><description>BKP</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register><register><name>BKP30R</name><displayName>BKP30R</displayName><description>backup register</description><addressOffset>0xC8</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>BKP</name><description>BKP</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register><register><name>BKP31R</name><displayName>BKP31R</displayName><description>backup register</description><addressOffset>0xCC</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>BKP</name><description>BKP</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register></registers></peripheral><peripheral><name>TIM6</name><description>Basic timers</description><groupName>TIMs</groupName><baseAddress>0x40001000</baseAddress><addressBlock><offset>0x0</offset><size>0x400</size><usage>registers</usage></addressBlock><interrupt><name>USB_WKUP</name><description>USB wakeup from Suspend</description><value>42</value></interrupt><interrupt><name>USB_HP</name><description>USB High priority interrupt</description><value>74</value></interrupt><interrupt><name>USB_LP</name><description>USB Low priority interrupt</description><value>75</value></interrupt><registers><register><name>CR1</name><displayName>CR1</displayName><description>control register 1</description><addressOffset>0x0</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x0000</resetValue><fields><field><name>CEN</name><description>Counter enable</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>UDIS</name><description>Update disable</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>URS</name><description>Update request source</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>OPM</name><description>One-pulse mode</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>ARPE</name><description>Auto-reload preload enable</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>UIFREMAP</name><description>UIF status bit remapping</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>CR2</name><displayName>CR2</displayName><description>control register 2</description><addressOffset>0x4</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x0000</resetValue><fields><field><name>MMS</name><description>Master mode selection</description><bitOffset>4</bitOffset><bitWidth>3</bitWidth></field></fields></register><register><name>DIER</name><displayName>DIER</displayName><description>DMA/Interrupt enable register</description><addressOffset>0xC</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x0000</resetValue><fields><field><name>UDE</name><description>Update DMA request enable</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>UIE</name><description>Update interrupt enable</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>SR</name><displayName>SR</displayName><description>status register</description><addressOffset>0x10</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x0000</resetValue><fields><field><name>UIF</name><description>Update interrupt flag</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>EGR</name><displayName>EGR</displayName><description>event generation register</description><addressOffset>0x14</addressOffset><size>0x20</size><access>write-only</access><resetValue>0x0000</resetValue><fields><field><name>UG</name><description>Update generation</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>CNT</name><displayName>CNT</displayName><description>counter</description><addressOffset>0x24</addressOffset><size>0x20</size><resetValue>0x00000000</resetValue><fields><field><name>CNT</name><description>Low counter value</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth><access>read-write</access></field><field><name>UIFCPY</name><description>UIF Copy</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field></fields></register><register><name>PSC</name><displayName>PSC</displayName><description>prescaler</description><addressOffset>0x28</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x0000</resetValue><fields><field><name>PSC</name><description>Prescaler value</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>ARR</name><displayName>ARR</displayName><description>auto-reload register</description><addressOffset>0x2C</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>ARR</name><description>Low Auto-reload value</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register></registers></peripheral><peripheral><name>DAC</name><description>Digital-to-analog converter</description><groupName>DAC</groupName><baseAddress>0x40007400</baseAddress><addressBlock><offset>0x0</offset><size>0x400</size><usage>registers</usage></addressBlock><interrupt><name>I2C1_EV_EXTI23</name><description>I2C1 event interrupt and EXTI Line23
        interrupt</description><value>31</value></interrupt><interrupt><name>I2C1_ER</name><description>I2C1 error interrupt</description><value>32</value></interrupt><registers><register><name>CR</name><displayName>CR</displayName><description>control register</description><addressOffset>0x0</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>DMAUDRIE2</name><description>DAC channel2 DMA underrun interrupt               enable</description><bitOffset>29</bitOffset><bitWidth>1</bitWidth></field><field><name>DMAEN2</name><description>DAC channel2 DMA enable</description><bitOffset>28</bitOffset><bitWidth>1</bitWidth></field><field><name>MAMP2</name><description>DAC channel2 mask/amplitude               selector</description><bitOffset>24</bitOffset><bitWidth>4</bitWidth></field><field><name>WAVE2</name><description>DAC channel2 noise/triangle wave               generation enable</description><bitOffset>22</bitOffset><bitWidth>2</bitWidth></field><field><name>TSEL2</name><description>DAC channel2 trigger               selection</description><bitOffset>19</bitOffset><bitWidth>3</bitWidth></field><field><name>TEN2</name><description>DAC channel2 trigger               enable</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth></field><field><name>BOFF2</name><description>DAC channel2 output buffer               disable</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth></field><field><name>EN2</name><description>DAC channel2 enable</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth></field><field><name>DMAUDRIE1</name><description>DAC channel1 DMA Underrun Interrupt               enable</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth></field><field><name>DMAEN1</name><description>DAC channel1 DMA enable</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field><field><name>MAMP1</name><description>DAC channel1 mask/amplitude               selector</description><bitOffset>8</bitOffset><bitWidth>4</bitWidth></field><field><name>WAVE1</name><description>DAC channel1 noise/triangle wave               generation enable</description><bitOffset>6</bitOffset><bitWidth>2</bitWidth></field><field><name>TSEL1</name><description>DAC channel1 trigger               selection</description><bitOffset>3</bitOffset><bitWidth>3</bitWidth></field><field><name>TEN1</name><description>DAC channel1 trigger               enable</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>BOFF1</name><description>DAC channel1 output buffer               disable</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>EN1</name><description>DAC channel1 enable</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>SWTRIGR</name><displayName>SWTRIGR</displayName><description>software trigger register</description><addressOffset>0x4</addressOffset><size>0x20</size><access>write-only</access><resetValue>0x00000000</resetValue><fields><field><name>SWTRIG2</name><description>DAC channel2 software               trigger</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>SWTRIG1</name><description>DAC channel1 software               trigger</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>DHR12R1</name><displayName>DHR12R1</displayName><description>channel1 12-bit right-aligned data holding           register</description><addressOffset>0x8</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>DACC1DHR</name><description>DAC channel1 12-bit right-aligned               data</description><bitOffset>0</bitOffset><bitWidth>12</bitWidth></field></fields></register><register><name>DHR12L1</name><displayName>DHR12L1</displayName><description>channel1 12-bit left aligned data holding           register</description><addressOffset>0xC</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>DACC1DHR</name><description>DAC channel1 12-bit left-aligned               data</description><bitOffset>4</bitOffset><bitWidth>12</bitWidth></field></fields></register><register><name>DHR8R1</name><displayName>DHR8R1</displayName><description>channel1 8-bit right aligned data holding           register</description><addressOffset>0x10</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>DACC1DHR</name><description>DAC channel1 8-bit right-aligned               data</description><bitOffset>0</bitOffset><bitWidth>8</bitWidth></field></fields></register><register><name>DHR12R2</name><displayName>DHR12R2</displayName><description>channel2 12-bit right aligned data holding           register</description><addressOffset>0x14</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>DACC2DHR</name><description>DAC channel2 12-bit right-aligned               data</description><bitOffset>0</bitOffset><bitWidth>12</bitWidth></field></fields></register><register><name>DHR12L2</name><displayName>DHR12L2</displayName><description>channel2 12-bit left aligned data holding           register</description><addressOffset>0x18</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>DACC2DHR</name><description>DAC channel2 12-bit left-aligned               data</description><bitOffset>4</bitOffset><bitWidth>12</bitWidth></field></fields></register><register><name>DHR8R2</name><displayName>DHR8R2</displayName><description>channel2 8-bit right-aligned data holding           register</description><addressOffset>0x1C</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>DACC2DHR</name><description>DAC channel2 8-bit right-aligned               data</description><bitOffset>0</bitOffset><bitWidth>8</bitWidth></field></fields></register><register><name>DHR12RD</name><displayName>DHR12RD</displayName><description>Dual DAC 12-bit right-aligned data holding           register</description><addressOffset>0x20</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>DACC2DHR</name><description>DAC channel2 12-bit right-aligned               data</description><bitOffset>16</bitOffset><bitWidth>12</bitWidth></field><field><name>DACC1DHR</name><description>DAC channel1 12-bit right-aligned               data</description><bitOffset>0</bitOffset><bitWidth>12</bitWidth></field></fields></register><register><name>DHR12LD</name><displayName>DHR12LD</displayName><description>DUAL DAC 12-bit left aligned data holding           register</description><addressOffset>0x24</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>DACC2DHR</name><description>DAC channel2 12-bit left-aligned               data</description><bitOffset>20</bitOffset><bitWidth>12</bitWidth></field><field><name>DACC1DHR</name><description>DAC channel1 12-bit left-aligned               data</description><bitOffset>4</bitOffset><bitWidth>12</bitWidth></field></fields></register><register><name>DHR8RD</name><displayName>DHR8RD</displayName><description>DUAL DAC 8-bit right aligned data holding           register</description><addressOffset>0x28</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>DACC2DHR</name><description>DAC channel2 8-bit right-aligned               data</description><bitOffset>8</bitOffset><bitWidth>8</bitWidth></field><field><name>DACC1DHR</name><description>DAC channel1 8-bit right-aligned               data</description><bitOffset>0</bitOffset><bitWidth>8</bitWidth></field></fields></register><register><name>DOR1</name><displayName>DOR1</displayName><description>channel1 data output register</description><addressOffset>0x2C</addressOffset><size>0x20</size><access>read-only</access><resetValue>0x00000000</resetValue><fields><field><name>DACC1DOR</name><description>DAC channel1 data output</description><bitOffset>0</bitOffset><bitWidth>12</bitWidth></field></fields></register><register><name>DOR2</name><displayName>DOR2</displayName><description>channel2 data output register</description><addressOffset>0x30</addressOffset><size>0x20</size><access>read-only</access><resetValue>0x00000000</resetValue><fields><field><name>DACC2DOR</name><description>DAC channel2 data output</description><bitOffset>0</bitOffset><bitWidth>12</bitWidth></field></fields></register><register><name>SR</name><displayName>SR</displayName><description>status register</description><addressOffset>0x34</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>DMAUDR2</name><description>DAC channel2 DMA underrun               flag</description><bitOffset>29</bitOffset><bitWidth>1</bitWidth></field><field><name>DMAUDR1</name><description>DAC channel1 DMA underrun               flag</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth></field></fields></register></registers></peripheral><peripheral><name>NVIC</name><description>Nested Vectored Interrupt Controller</description><groupName>NVIC</groupName><baseAddress>0xE000E000</baseAddress><addressBlock><offset>0x0</offset><size>0x1001</size><usage>registers</usage></addressBlock><interrupt><name>I2C2_EV_EXTI24</name><description>I2C2 event interrupt &amp; EXTI Line24
