MaJerle/stm32f429/00-STM32_SVD/STM32F302x.svd
fset><bitWidth>16</bitWidth></field></fields></register><register><name>BDTR</name><displayName>BDTR</displayName><description>break and dead-time register</description><addressOffset>0x44</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>DTG</name><description>Dead-time generator setup</description><bitOffset>0</bitOffset><bitWidth>8</bitWidth></field><field><name>LOCK</name><description>Lock configuration</description><bitOffset>8</bitOffset><bitWidth>2</bitWidth></field><field><name>OSSI</name><description>Off-state selection for Idle               mode</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field><field><name>OSSR</name><description>Off-state selection for Run               mode</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field><field><name>BKE</name><description>Break enable</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field><field><name>BKP</name><description>Break polarity</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth></field><field><name>AOE</name><description>Automatic output enable</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field><field><name>MOE</name><description>Main output enable</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field><field><name>BKF</name><description>Break filter</description><bitOffset>16</bitOffset><bitWidth>4</bitWidth></field><field><name>BK2F</name><description>Break 2 filter</description><bitOffset>20</bitOffset><bitWidth>4</bitWidth></field><field><name>BK2E</name><description>Break 2 enable</description><bitOffset>24</bitOffset><bitWidth>1</bitWidth></field><field><name>BK2P</name><description>Break 2 polarity</description><bitOffset>25</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>DCR</name><displayName>DCR</displayName><description>DMA control register</description><addressOffset>0x48</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>DBL</name><description>DMA burst length</description><bitOffset>8</bitOffset><bitWidth>5</bitWidth></field><field><name>DBA</name><description>DMA base address</description><bitOffset>0</bitOffset><bitWidth>5</bitWidth></field></fields></register><register><name>DMAR</name><displayName>DMAR</displayName><description>DMA address for full transfer</description><addressOffset>0x4C</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>DMAB</name><description>DMA register for burst               accesses</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>CCMR3_Output</name><displayName>CCMR3_Output</displayName><description>capture/compare mode register 3 (output           mode)</description><addressOffset>0x54</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>OC5FE</name><description>Output compare 5 fast               enable</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>OC5PE</name><description>Output compare 5 preload               enable</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>OC5M</name><description>Output compare 5 mode</description><bitOffset>4</bitOffset><bitWidth>3</bitWidth></field><field><name>OC5CE</name><description>Output compare 5 clear               enable</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>OC6FE</name><description>Output compare 6 fast               enable</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field><field><name>OC6PE</name><description>Output compare 6 preload               enable</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field><field><name>OC6M</name><description>Output compare 6 mode</description><bitOffset>12</bitOffset><bitWidth>3</bitWidth></field><field><name>OC6CE</name><description>Output compare 6 clear               enable</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field><field><name>OC5M_3</name><description>Outout Compare 5 mode bit               3</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth></field><field><name>OC6M_3</name><description>Outout Compare 6 mode bit               3</description><bitOffset>24</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>CCR5</name><displayName>CCR5</displayName><description>capture/compare register 5</description><addressOffset>0x58</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>CCR5</name><description>Capture/Compare 5 value</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field><field><name>GC5C1</name><description>Group Channel 5 and Channel               1</description><bitOffset>29</bitOffset><bitWidth>1</bitWidth></field><field><name>GC5C2</name><description>Group Channel 5 and Channel               2</description><bitOffset>30</bitOffset><bitWidth>1</bitWidth></field><field><name>GC5C3</name><description>Group Channel 5 and Channel               3</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>CCR6</name><displayName>CCR6</displayName><description>capture/compare register 6</description><addressOffset>0x5C</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>CCR6</name><description>Capture/Compare 6 value</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>OR</name><displayName>OR</displayName><description>option registers</description><addressOffset>0x60</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x00000000</resetValue><fields><field><name>TIM1_ETR_ADC1_RMP</name><description>TIM1_ETR_ADC1 remapping               capability</description><bitOffset>0</bitOffset><bitWidth>2</bitWidth></field><field><name>TIM1_ETR_ADC4_RMP</name><description>TIM1_ETR_ADC4 remapping               capability</description><bitOffset>2</bitOffset><bitWidth>2</bitWidth></field></fields></register></registers></peripheral><peripheral><name>ADC1</name><description>Analog-to-Digital Converter</description><groupName>ADC</groupName><baseAddress>0x50000000</baseAddress><addressBlock><offset>0x0</offset><size>0x400</size><usage>registers</usage></addressBlock><interrupt><name>TIM6_DACUNDER</name><description>TIM6 global and DAC12 underrun
