MaJerle/stm32f429/00-STM32_SVD/STM32F302x.svd
</register><register><name>EXTICR1</name><displayName>EXTICR1</displayName><description>external interrupt configuration register           1</description><addressOffset>0x8</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x0000</resetValue><fields><field><name>EXTI3</name><description>EXTI 3 configuration bits</description><bitOffset>12</bitOffset><bitWidth>4</bitWidth></field><field><name>EXTI2</name><description>EXTI 2 configuration bits</description><bitOffset>8</bitOffset><bitWidth>4</bitWidth></field><field><name>EXTI1</name><description>EXTI 1 configuration bits</description><bitOffset>4</bitOffset><bitWidth>4</bitWidth></field><field><name>EXTI0</name><description>EXTI 0 configuration bits</description><bitOffset>0</bitOffset><bitWidth>4</bitWidth></field></fields></register><register><name>EXTICR2</name><displayName>EXTICR2</displayName><description>external interrupt configuration register           2</description><addressOffset>0xC</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x0000</resetValue><fields><field><name>EXTI7</name><description>EXTI 7 configuration bits</description><bitOffset>12</bitOffset><bitWidth>4</bitWidth></field><field><name>EXTI6</name><description>EXTI 6 configuration bits</description><bitOffset>8</bitOffset><bitWidth>4</bitWidth></field><field><name>EXTI5</name><description>EXTI 5 configuration bits</description><bitOffset>4</bitOffset><bitWidth>4</bitWidth></field><field><name>EXTI4</name><description>EXTI 4 configuration bits</description><bitOffset>0</bitOffset><bitWidth>4</bitWidth></field></fields></register><register><name>EXTICR3</name><displayName>EXTICR3</displayName><description>external interrupt configuration register           3</description><addressOffset>0x10</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x0000</resetValue><fields><field><name>EXTI11</name><description>EXTI 11 configuration bits</description><bitOffset>12</bitOffset><bitWidth>4</bitWidth></field><field><name>EXTI10</name><description>EXTI 10 configuration bits</description><bitOffset>8</bitOffset><bitWidth>4</bitWidth></field><field><name>EXTI9</name><description>EXTI 9 configuration bits</description><bitOffset>4</bitOffset><bitWidth>4</bitWidth></field><field><name>EXTI8</name><description>EXTI 8 configuration bits</description><bitOffset>0</bitOffset><bitWidth>4</bitWidth></field></fields></register><register><name>EXTICR4</name><displayName>EXTICR4</displayName><description>external interrupt configuration register           4</description><addressOffset>0x14</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x0000</resetValue><fields><field><name>EXTI15</name><description>EXTI 15 configuration bits</description><bitOffset>12</bitOffset><bitWidth>4</bitWidth></field><field><name>EXTI14</name><description>EXTI 14 configuration bits</description><bitOffset>8</bitOffset><bitWidth>4</bitWidth></field><field><name>EXTI13</name><description>EXTI 13 configuration bits</description><bitOffset>4</bitOffset><bitWidth>4</bitWidth></field><field><name>EXTI12</name><description>EXTI 12 configuration bits</description><bitOffset>0</bitOffset><bitWidth>4</bitWidth></field></fields></register><register><name>CFGR2</name><displayName>CFGR2</displayName><description>configuration register 2</description><addressOffset>0x18</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x0000</resetValue><fields><field><name>LOCUP_LOCK</name><description>Cortex-M0 LOCKUP bit enable               bit</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>SRAM_PARITY_LOCK</name><description>SRAM parity lock bit</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>PVD_LOCK</name><description>PVD lock enable bit</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>BYP_ADD_PAR</name><description>Bypass address bit 29 in parity               calculation</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>SRAM_PEF</name><description>SRAM parity flag</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>RCR</name><displayName>RCR</displayName><description>CCM SRAM protection register</description><addressOffset>0x4</addressOffset><size>0x20</size><access>read-write</access><resetValue>0x0000</resetValue><fields><field><name>PAGE0_WP</name><description>CCM SRAM page write protection               bit</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>PAGE1_WP</name><description>CCM SRAM page write protection               bit</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>PAGE2_WP</name><description>CCM SRAM page write protection               bit</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>PAGE3_WP</name><description>CCM SRAM page write protection               bit</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>PAGE4_WP</name><description>CCM SRAM page write protection               bit</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>PAGE5_WP</name><description>CCM SRAM page write protection               bit</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>PAGE6_WP</name><description>CCM SRAM page write protection               bit</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>PAGE7_WP</name><description>CCM SRAM page write protection               bit</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field></fields></register></registers></peripheral><peripheral><name>OPAMP</name><description>Operational amplifier</description><groupName>OPAMP</groupName><baseAddress>0x40010038</baseAddress><addressBlock><offset>0x0</offset><size>0x3C8</size><usage>registers</usage></addressBlock><interrupt><name>TIM6_DACUNDER</name><description>TIM6 global and DAC12 underrun
        interrupts</description><value>54</value></interrupt><registers><register><name>OPAMP1_CR</name><displayName>OPAMP1_CR</displayName><description>OPAMP1 control register</description><addressOffset>0x0</addressOffset><size>0x20</size><resetValue>0x00000000</resetValue><fields><field><name>OPAMP1_EN</name><description>OPAMP1 enable</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>FORCE_VP</name><description>FORCE_VP</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>VP_SEL</name><description>OPAMP1 Non inverting input               selection</description><bitOffset>2</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>VM_SEL</name><description>OPAMP1 inverting input               selection</description><bitOffset>5</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>TCM_EN</name><description>Timer controlled Mux mode               enable</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>VMS_SEL</name><description>OPAMP1 inverting input secondary               selection</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>VPS_SEL</name><description>OPAMP1 Non inverting input secondary               selection</description><bitOffset>9</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>CALON</name><description>Calibration mode enable</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CALSEL</name><description>Calibration selection</description><bitOffset>12</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>PGA_GAIN</name><description>Gain in PGA mode</description><bitOffset>14</bitOffset><bitWidth>4</bitWidth><access>read-write</access></field><field><name>USER_TRIM</name><description>User trimming enable</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TRIMOFFSETP</name><description>Offset trimming value               (PMOS)</description><bitOffset>19</bitOffset><bitWidth>5</bitWidth><access>read-write</access></field><field><name>TRIMOFFSETN</name><description>Offset trimming value               (NMOS)</description><bitOffset>24</bitOffset><bitWidth>5</bitWidth><access>read-write</access></field><field><name>TSTREF</name><description>TSTREF</description><bitOffset>29</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>OUTCAL</name><description>OPAMP 1 ouput status flag</description><bitOffset>30</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>LOCK</name><description>OPAMP 1 lock</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>OPAMP2_CR</name><displayName>OPAMP2_CR</displayName><description>OPAMP2 control register</description><addressOffset>0x4</addressOffset><size>0x20</size><resetValue>0x00000000</resetValue><fields><field><name>OPAMP2EN</name><description>OPAMP2 enable</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>FORCE_VP</name><description>FORCE_VP</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>VP_SEL</name><description>OPAMP2 Non inverting input               selection</description><bitOffset>2</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>VM_SEL</name><description>OPAMP2 inverting input               selection</description><bitOffset>5</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>TCM_EN</name><description>Timer controlled Mux mode               enable</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>VMS_SEL</name><description>OPAMP2 inverting input secondary               selection</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>VPS_SEL</name><description>OPAMP2 Non inverting input secondary               selection</description><bitOffset>9</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>CALON</name><description>Calibration mode enable</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CAL_SEL</name><description>Calibration selection</description><bitOffset>12</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>PGA_GAIN</name><description>Gain in PGA mode</description><bitOffset>14</bitOffset><bitWidth>4</bitWidth><access>read-write</access></field><field><name>USER_TRIM</name><description>User trimming enable</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TRIMOFFSETP</name><description>Offset trimming value               (PMOS)</description><bitOffset>19</bitOffset><bitWidth>5</bitWidth><access>read-write</access></field><field><name>TRIMOFFSETN</name><description>Offset trimming value               (NMOS)</description><bitOffset>24</bitOffset><bitWidth>5</bitWidth><access>read-write</access></field><field><name>TSTREF</name><description>TSTREF</description><bitOffset>29</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>OUTCAL</name><description>OPAMP 2 ouput status flag</description><bitOffset>30</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>LOCK</name><description>OPAMP 2 lock</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>OPAMP3_CR</name><displayName>OPAMP3_CR</displayName><description>OPAMP3 control register</description><addressOffset>0x8</addressOffset><size>0x20</size><resetValue>0x00000000</resetValue><fields><field><name>OPAMP3EN</name><description>OPAMP3 enable</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>FORCE_VP</name><description>FORCE_VP</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>VP_SEL</name><description>OPAMP3 Non inverting input               selection</description><bitOffset>2</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>VM_SEL</name><description>OPAMP3 inverting input               selection</description><bitOffset>5</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>TCM_EN</name><description>Timer controlled Mux mode               enable</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>VMS_SEL</name><description>OPAMP3 inverting input secondary               selection</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>VPS_SEL</name><description>OPAMP3 Non inverting input secondary               selection</description><bitOffset>9</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>CALON</name><description>Calibration mode enable</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CALSEL</name><description>Calibration selection</description><bitOffset>12</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>PGA_GAIN</name><description>Gain in PGA mode</description><bitOffset>14</bitOffset><bitWidth>4</bitWidth><access>read-write</access></field><field><name>USER_TRIM</name><description>User trimming enable</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TRIMOFFSETP</name><description>Offset trimming value               (PMOS)</description><bitOffset>19</bitOffset><bitWidth>5</bitWidth><access>read-write</access></field><field><name>TRIMOFFSETN</name><description>Offset trimming value               (NMOS)</description><bitOffset>24</bitOffset><bitWidth>5</bitWidth><access>read-write</access></field><field><name>TSTREF</name><description>TSTREF</description><bitOffset>29</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>OUTCAL</name><description>OPAMP 3 ouput status flag</description><bitOffset>30</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>LOCK</name><description>OPAMP 3 lock</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>OPAMP4_CR</name><displayName>OPAMP4_CR</displayName><description>OPAMP4 control register</description><addressOffset>0xC</addressOffset><size>0x20</size><resetValue>0x00000000</resetValue><fields><field><name>OPAMP4EN</name><description>OPAMP4 enable</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>FORCE_VP</name><description>FORCE_VP</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>VP_SEL</name><description>OPAMP4 Non inverting input               selection</description><bitOffset>2</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>VM_SEL</name><description>OPAMP4 inverting input               selection</description><bitOffset>5</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>TCM_EN</name><description>Timer controlled Mux mode               enable</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>VMS_SEL</name><description>OPAMP4 inverting input secondary               selection</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>VPS_SEL</name><description>OPAMP4 Non inverting input secondary               selection</description><bitOffset>9</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>CALON</name><description>Calibration mode enable</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CALSEL</name><description>Calibration selection</description><bitOffset>12</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>PGA_GAIN</name><description>Gain in PGA mode</description><bitOffset>14</bitOffset><bitWidth>4</bitWidth><access>read-write</access></field><field><name>USER_TRIM</name><description>User trimming enable</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TRIMOFFSETP</name><description>Offset trimming value               (PMOS)</description><bitOffset>19</bitOffset><bitWidth>5</bitWidth><access>read-write</access></field><field><name>TRIMOFFSETN</name><description>Offset trimming value               (NMOS)</description><bitOffset>24</bitOffset><bitWidth>5</bitWidth><access>read-write</access></field><field><name>TSTREF</name><description>TSTREF</description><bitOffset>29</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>OUTCAL</name><description>OPAMP 4 ouput status flag</description><bitOffset>30</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>LOCK</name><description>OPAMP 4 lock</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register></registers></peripheral></peripherals></device>